{
  "backend/main.mo": "Motoko canister managing user profiles with access control plus public inquiry creation and admin-only inquiry retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for quick reference.",
  "frontend/index.css": "Global Tailwind base styles defining color tokens, CSS variables, and dark-mode overrides.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public site routes and admin routes protected by AdminGuard.",
  "frontend/src/components/admin/AdminGuard.tsx": "Checks Internet Identity authentication and admin role before rendering protected children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity with state handling and query cache clearing.",
  "frontend/src/components/inquiry/InquiryForm.tsx": "Validated inquiry submission form with client-side checks, success/error states, and backend mutation.",
  "frontend/src/components/inquiry/inquiryMapping.ts": "Formats inquiry form data into subject/body fields and assigns backend MessageType.inquiry.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with company info, quick links, and a copyright notice using Lucide icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Implements a responsive header with navigation links, logo, login button, and mobile menu sheet.",
  "frontend/src/components/site/SiteLayout.tsx": "Wraps pages with a consistent layout including header, footer, and main content area.",
  "frontend/src/components/site/ThemeCard.tsx": "Provides a styled card component with optional title, description, and custom content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles authentication via Internet Identity, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, and inquiries through the actor.",
  "frontend/src/index.css": "Configures Tailwind styles and defines a custom industrial-themed color palette and utilities.",
  "frontend/src/main.tsx": "Initializes the app root, setting up React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, and themed content sections using ThemeCard components.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Lists and manages submitted inquiries with loading/error states, sorting, and navigation to individual inquiry details.",
  "frontend/src/pages/admin/AdminInquiryDetailsPage.tsx": "Displays detailed information for a single inquiry with submitter data, message body, and navigation back to the inquiries list.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with header, contact info, and an inquiry form using ThemeCard and InquiryForm components.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero section, call‑to‑action buttons, feature cards, and promotional content for aluminum trading.",
  "frontend/src/pages/TradingPage.tsx": "Provides trading information including material categories and a step‑by‑step overview of the trading process using multiple ThemeCard sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, including support for hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing existing features, pending requests, project metadata, and required generated images for the ARDEE INDUSTRIES website."
}