{
  "backend/main.mo": "Motoko canister implementing user profile access with authorization checks and an inquiry system with admin-restricted retrieval.",
  "feature_evidence.json": "Feature evidence report listing required UI copy changes and files impacted by two content-related features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark themes and global element styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public routes and admin-protected inquiry management routes using AdminGuard.",
  "frontend/src/components/admin/AdminGuard.tsx": "Component that restricts access to admin-only areas based on Internet Identity authentication and user role.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with query cache clearing on logout.",
  "frontend/src/components/inquiry/InquiryForm.tsx": "User inquiry form with validation, consent check, submission handling, and success/error states.",
  "frontend/src/components/inquiry/inquiryMapping.ts": "Formats inquiry form data into subject/body text and assigns MessageType.inquiry for backend submission.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with company info, quick links, contact details, and a copyright section with branding.",
  "frontend/src/components/site/SiteHeader.tsx": "Provides a responsive site header with navigation links, logo, login button, and a mobile menu using a sheet drawer.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the main site layout wrapper including header, footer, and a flexible content area.",
  "frontend/src/components/site/ThemeCard.tsx": "Reusable card component that displays optional title and description with styled content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, managing login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, roles, and inquiries, using the actor to interact with the backend.",
  "frontend/src/index.css": "Tailwind base styles with custom industrial-themed CSS variables and utility patterns for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with sections for mission, values, and company information using themed cards and icons.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin view listing all submitted inquiries with loading and error states. Supports navigation to individual inquiry details.",
  "frontend/src/pages/admin/AdminInquiryDetailsPage.tsx": "Shows detailed information for a single inquiry including metadata and message body. Includes navigation back to the inquiries list.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with company contact details and an inquiry form. Uses ThemeCard and InquiryForm components.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage layout with a hero section, feature highlights, and links to key pages. Emphasizes aluminum can trading services.",
  "frontend/src/pages/TradingPage.tsx": "Displays trading offerings including material types and a step-by-step explanation of the trading process. Uses ThemeCard components for each material category.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing persisted values. Supports both query string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, scanning frontend files, extending theme colors, fonts, animations, and adding plugins like typography, container queries, and animate.",
  "project_state.json": "JSON describing the project's current feature set, versions, and summaries for an ICP canister-based web app with frontend and backend capabilities."
}