{
  "kind": "build_request",
  "title": "Remove all 'recycling' wording and add Wada MIDC warehouse copy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all occurrences of the word \"recycling\" from all public-facing marketing UI copy across the site (including Home, About, Trading, Contact pages, and shared layout components like the footer). Replace the affected sentences/headings with alternative wording that preserves meaning but does not use the word \"recycling\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "And remove all recycling word and add we have warehouse in wada midc"
        ]
      },
      "acceptanceCriteria": [
        "The rendered public pages (Home, About, Trading, Contact) contain zero instances of the word \"recycling\" (case-insensitive).",
        "Shared components (e.g., footer/header) contain zero instances of the word \"recycling\" (case-insensitive).",
        "No new UI copy introduces the word \"recycling\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the exact sentence \"We have a warehouse in Wada MIDC\" to the public site content in a visible, appropriate location (at minimum on the Contact page contact information area; optionally also in the footer/company info if it improves consistency).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "And remove all recycling word and add we have warehouse in wada midc"
        ]
      },
      "acceptanceCriteria": [
        "The Contact page displays the sentence \"We have a warehouse in Wada MIDC\" in English exactly as written.",
        "The sentence is visible without requiring login and appears in a non-collapsed section of the page."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn/ui components are read-only).",
    "Do not modify frontend immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend architecture as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add or change authentication behavior.",
    "Do not change inquiry submission backend schema or admin inquiry management features.",
    "Do not add domain/email hosting functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}