{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove 'recycling' wording and add Wada MIDC warehouse copy",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all instances of the word \"recycling\" from public marketing copy and replace with equivalent wording that preserves meaning.",
      "acceptanceCriteria": [
        "The rendered public pages (Home, About, Trading, Contact) contain zero instances of the word \"recycling\" (case-insensitive).",
        "Shared components (e.g., footer/header) contain zero instances of the word \"recycling\" (case-insensitive).",
        "No new UI copy introduces the word \"recycling\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update hero and feature-section marketing copy to remove the word \"recycling\" while keeping the same intent (e.g., refer to aluminum can trading, circular economy, sustainability, and material recovery without using the word)."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Revise all public-facing About page headings and paragraphs containing the word \"recycling\" (including phrases like \"sustainable recycling solutions\" and \"global recycling market\") to alternative wording that preserves meaning but contains zero instances of \"recycling\"."
        },
        {
          "path": "frontend/src/pages/TradingPage.tsx",
          "operation": "modify",
          "description": "Update Trading page header and 'What We Trade' descriptions to remove the word \"recycling\" (including references like \"recycled ...\" sentences that include \"recycling\" and any mention of \"recycling market\"), ensuring the content remains accurate and clear."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Verify and update Contact page visible marketing copy to ensure it contains zero instances of the word \"recycling\" (case-insensitive), without changing inquiry submission behavior."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Remove/replace the word \"recycling\" from the footer company description and any other footer copy while preserving meaning and keeping the footer public."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add the exact sentence \"We have a warehouse in Wada MIDC\" to a visible location on the Contact page (and optionally also in the footer for consistency).",
      "acceptanceCriteria": [
        "The Contact page displays the sentence \"We have a warehouse in Wada MIDC\" in English exactly as written.",
        "The sentence is visible without requiring login and appears in a non-collapsed section of the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Add the exact sentence \"We have a warehouse in Wada MIDC\" in the Contact page contact information area in a clearly visible, non-collapsed section (e.g., near the Location block or within the contact info card)."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Optionally add the exact sentence \"We have a warehouse in Wada MIDC\" to the footer contact/company info area to improve consistency across public pages while keeping it visible and not behind any authentication."
        }
      ]
    }
  ]
}